import random
import vk_api
import time

def captcha_handler(captcha):
    print("Капча, подождите 10-20 секунд...")
    time.sleep(random.randint(10, 20))
    return

def getSession(token):
    vk_session = vk_api.VkApi(token=token["token"], captcha_handler=captcha_handler)
    vk = vk_session.get_api()
    return {"vks": vk_session, "vkApi": vk, "token": token}

mess = "😀😁😂😃😄🤣😅😆😇😉😊🙂🙃☺😋😌😍🥰😘😗😙😚🤪😜😝😛🤑😎🤓🧐🥸🤠🥳🤗🤡😏😶😐😑😒🙄🤨🤔🤫🤭🤥😳😞😟😠😡🤬😔😕🙁☹😬🥺😣😖😫😩🥱😤😮😱😨😰😯😦😧   😢😥😪🥲🤤😓😭🤩😵🥴😲🤯🤐😷🤕🤒🤮🤢🤧🥵🥶😴💤😈👿👹👺💩👻💀☠👽🤖🎃😺😸😹😻😼😽🙀😿😾👐🤲🙌👏🙏🤝👍👎👊✊🤛🤜🤞✌🤘🤟👌🤏👈👉👆👇☝✋🤚🖐🖖👋🤙🤌💪🦾🖕✍🤳💅🦵🦿🦶👄🦷👅👂🦻👃👁👀🧠🫀🫁🦴👤👥🫂🗣👶👧🧒👦👩🧑👨👩‍🦱 👨‍🦱👩‍🦰 👨‍🦰👱‍♀️👱👱‍♂️👩‍🦳 👨‍🦳👩‍🦲 👨‍🦲🧔👵🧓👴👲👳‍♀️👳👳‍♂️🧕👮‍♀️👮👮‍♂️👩‍🚒 👨‍🚒👷‍♀️👷👷‍♂️👩‍🏭 👨‍🏭👩‍🔧 👨‍🔧👩‍🌾 👨‍🌾👩‍🍳 👨‍🍳👩‍🎤 👨‍🎤👩‍🎨 👨‍🎨👩‍🏫 👨‍🏫👩‍🎓 👨‍🎓👩‍💼 👨‍💼👩‍💻 👨‍💻👩‍🔬 👨‍🔬👩‍🚀 👨‍🚀👩‍⚕️ 👨‍⚕️👩‍⚖️ 👨‍⚖️👩‍✈️ 👨‍✈️  💂‍♀️💂💂‍♂️🥷🕵️‍♀️🕵🕵️‍♂️🤶🎅 👼👸🤴👰   🤵 🕴️‍♀️🕴 🦸‍♀️🦸🦸‍♂️🦹‍♀️🦹🦹‍♂️🧙‍♀️🧙🧙‍♂️🧝‍♀️🧝🧝‍♂️🧚‍♀️🧚🧚‍♂️🧞‍♀️🧞🧞‍♂️🧜‍♀️🧜🧜‍♂️🧛‍♀️🧛🧛‍♂️🧟‍♀️🧟🧟‍♂️🙇‍♀️🙇🙇‍♂️💁‍♀️💁💁‍♂️🙅‍♀️🙅🙅‍♂️🙆‍♀️🙆🙆‍♂️🤷‍♀️🤷🤷‍♂️🙋‍♀️🙋🙋‍♂️🤦‍♀️🤦🤦‍♂️🧏‍♀️🧏🧏‍♂️🙎‍♀️🙎🙎‍♂️🙍‍♀️🙍🙍‍♂️💇‍♀️💇💇‍♂️💆‍♀️💆💆‍♂️🤰🤱   🧎‍♀️🧎🧎‍♂️🧍‍♀️🧍🧍‍♂️🚶‍♀️🚶🚶‍♂️👩‍🦯 👨‍🦯🏃‍♀️🏃🏃‍♂️👩‍🦼 👨‍🦼👩‍🦽 👨‍🦽💃🕺👯‍♀️👯👯‍♂️👫👩‍❤️‍👨💑👩‍❤️‍💋‍👨💏👪👨‍👩‍👧   👩‍👦👩‍👧👩‍👧‍👦👩‍👦‍👦👩‍👧‍👧👨‍👦👨‍👧👨‍👧‍👦👨‍👦‍👦👨‍👧‍👧👚👕🥼🦺🧥👖👔👗👘🥻🩱👙🩲🩳💄💋👣🧦👠👡👢🥿👞👟🩰🥾🩴🧢👒🎩🎓👑⛑🪖🎒👝👛👜💼👓🕶🥽🧣🧤💍🌂☂"